In [120]:
#!pip install kaggle

Collecting kaggle
  Downloading kaggle-1.6.17.tar.gz (82 kB)
     ---------------------------------------- 0.0/82.7 kB ? eta -:--:--
     ---- ----------------------------------- 10.2/82.7 kB ? eta -:--:--
     ---- ----------------------------------- 10.2/82.7 kB ? eta -:--:--
     -------------- ----------------------- 30.7/82.7 kB 187.9 kB/s eta 0:00:01
     ------------------ ------------------- 41.0/82.7 kB 196.9 kB/s eta 0:00:01
     -------------------------------------- 82.7/82.7 kB 356.9 kB/s eta 0:00:00
  Preparing metadata (setup.py): started
  Preparing metadata (setup.py): finished with status 'done'
Requirement already satisfied: six>=1.10 in c:\users\dell\anaconda3\lib\site-packages (from kaggle) (1.16.0)
Requirement already satisfied: certifi>=2023.7.22 in c:\users\dell\anaconda3\lib\site-packages (from kaggle) (2024.2.2)
Requirement already satisfied: python-dateutil in c:\users\dell\anaconda3\lib\site-packages (from kaggle) (2.8.2)
Requirement already satisfied: requests in c:\users\dell\anaconda3\lib\site-packages (from kaggle) (2.31.0)
Requirement already satisfied: tqdm in c:\users\dell\anaconda3\lib\site-packages (from kaggle) (4.65.0)
Requirement already satisfied: python-slugify in c:\users\dell\anaconda3\lib\site-packages (from kaggle) (5.0.2)
Requirement already satisfied: urllib3 in c:\users\dell\anaconda3\lib\site-packages (from kaggle) (2.2.1)
Requirement already satisfied: bleach in c:\users\dell\anaconda3\lib\site-packages (from kaggle) (4.1.0)
Requirement already satisfied: packaging in c:\users\dell\anaconda3\lib\site-packages (from bleach->kaggle) (23.2)
Requirement already satisfied: webencodings in c:\users\dell\anaconda3\lib\site-packages (from bleach->kaggle) (0.5.1)
Requirement already satisfied: text-unidecode>=1.3 in c:\users\dell\anaconda3\lib\site-packages (from python-slugify->kaggle) (1.3)
Requirement already satisfied: charset-normalizer<4,>=2 in c:\users\dell\anaconda3\lib\site-packages (from requests->kaggle) (3.3.2)
Requirement already satisfied: idna<4,>=2.5 in c:\users\dell\anaconda3\lib\site-packages (from requests->kaggle) (3.4)
Requirement already satisfied: colorama in c:\users\dell\anaconda3\lib\site-packages (from tqdm->kaggle) (0.4.6)
Building wheels for collected packages: kaggle
  Building wheel for kaggle (setup.py): started
  Building wheel for kaggle (setup.py): finished with status 'done'
  Created wheel for kaggle: filename=kaggle-1.6.17-py3-none-any.whl size=105802 sha256=5a5f861e27de38c66eb52334582e287ea3ba6c563e4f4c1d9e8fb610df123c57
  Stored in directory: c:\users\dell\appdata\local\pip\cache\wheels\ff\55\fb\b27a466be754d2a06ffe0e37b248d844f090a63b51becea85d
Successfully built kaggle
Installing collected packages: kaggle
Successfully installed kaggle-1.6.17

In [124]:
# !kaggle datasets download akshatagrawal9431/shipment-orders-dataset -f orders_data.csv

Dataset URL: https://www.kaggle.com/datasets/akshatagrawal9431/shipment-orders-dataset
License(s): CC0-1.0
Downloading orders_data.csv.zip to C:\Users\DELL

  0%|          | 0.00/197k [00:00<?, ?B/s]
100%|##########| 197k/197k [00:00<00:00, 279kB/s]
100%|##########| 197k/197k [00:00<00:00, 279kB/s]

In [131]:
# import zipfile
# file=zipfile.ZipFile("orders_data.csv.zip")
# file.extractall()
# file.close()

In [281]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [86]:
df=pd.read_csv("orders_data.csv",na_values=["Not Available",'unknown','nan'])

In [87]:
df.head(2)

,Order Id,Order Date,Ship Mode,Segment,Country,City,State,Postal Code,Region,Category,Sub Category,Product Id,cost price,List Price,Quantity,Discount Percent
0,1,01-03-2023,Second Class,Consumer,United States,Henderson,Kentucky,42420,South,Furniture,Bookcases,FUR-BO-10001798,240,260,2,2
1,2,15-08-2023,Second Class,Consumer,United States,Henderson,Kentucky,42420,South,Furniture,Chairs,FUR-CH-10000454,600,730,3,3

In [106]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9994 entries, 0 to 9993
Data columns (total 16 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Order Id          9994 non-null   int64
 1   Order Date        9994 non-null   datetime64[ns]
 2   Ship Mode         9994 non-null   object
 3   Segment           9994 non-null   object
 4   Country           9994 non-null   object
 5   City              9994 non-null   object
 6   State             9994 non-null   object
 7   Postal Code       9994 non-null   int64
 8   Region            9994 non-null   object
 9   Category          9994 non-null   object
 10  Sub Category      9994 non-null   object
 11  Product Id        9994 non-null   object
 12  cost price        9994 non-null   int64
 13  List Price        9994 non-null   int64
 14  Quantity          9994 non-null   int64
 15  Discount Percent  9994 non-null   int64
dtypes: datetime64[ns](1), int64(6), object(9)
memory usage: 1.2+ MB

In [102]:
df.isnull().sum()

Order Id            0
Order Date          0
Ship Mode           0
Segment             0
Country             0
City                0
State               0
Postal Code         0
Region              0
Category            0
Sub Category        0
Product Id          0
cost price          0
List Price          0
Quantity            0
Discount Percent    0
dtype: int64

In [91]:
df["Ship Mode"].unique()

array(['Second Class', 'Standard Class', nan, 'First Class', 'Same Day'],
      dtype=object)

In [98]:
df[df["Ship Mode"].isnull()]

,Order Id,Order Date,Ship Mode,Segment,Country,City,State,Postal Code,Region,Category,Sub Category,Product Id,cost price,List Price,Quantity,Discount Percent
5,6,13-03-2022,NaN,Consumer,United States,Los Angeles,California,90032,West,Furniture,Furnishings,FUR-FU-10001487,50,50,7,3
8,9,23-03-2023,NaN,Consumer,United States,Los Angeles,California,90032,West,Office Supplies,Binders,OFF-BI-10003910,20,20,3,2
10,11,31-03-2023,NaN,Consumer,United States,Los Angeles,California,90032,West,Furniture,Tables,FUR-TA-10001539,1470,1710,9,3
11,12,25-12-2023,NaN,Consumer,United States,Los Angeles,California,90032,West,Technology,Phones,TEC-PH-10002033,750,910,4,3
14,15,09-11-2023,NaN,Home Office,United States,Fort Worth,Texas,76106,Central,Office Supplies,Appliances,OFF-AP-10002311,60,70,5,5
118,119,19-07-2023,NaN,Corporate,United States,Bristol,Tennessee,37620,South,Office Supplies,Binders,OFF-BI-10003650,140,160,1,5

In [101]:
df["Ship Mode"]=df["Ship Mode"].fillna(df["Ship Mode"].mode()[0])

In [103]:
df.describe()

,Order Id,Postal Code,cost price,List Price,Quantity,Discount Percent
count,9994.000000,9994.000000,9994.000000,9994.000000,9994.000000,9994.000000
mean,4997.500000,55190.379428,201.189714,229.756854,3.789574,3.484090
std,2885.163629,32063.693350,537.743203,623.245839,2.225110,1.114211
min,1.000000,1040.000000,0.000000,0.000000,1.000000,2.000000
25%,2499.250000,23223.000000,20.000000,20.000000,2.000000,2.000000
50%,4997.500000,56430.500000,50.000000,50.000000,3.000000,3.000000
75%,7495.750000,90008.000000,180.000000,210.000000,5.000000,4.000000
max,9994.000000,99301.000000,18110.000000,22640.000000,14.000000,5.000000

In [113]:
df.head(2)

,Order Id,Order Date,Ship Mode,Segment,Country,City,State,Postal Code,Region,Category,Sub Category,Product Id,cost price,List Price,Quantity,Discount Percent,Order_month,Order_year,Discounted_price,Total_Sales
0,1,2023-03-01,Second Class,Consumer,United States,Henderson,Kentucky,42420,South,Furniture,Bookcases,FUR-BO-10001798,240,260,2,2,3,2023,254.8,509.6
1,2,2023-08-15,Second Class,Consumer,United States,Henderson,Kentucky,42420,South,Furniture,Chairs,FUR-CH-10000454,600,730,3,3,8,2023,708.1,2124.3

In [105]:
df["Order Date"]=pd.to_datetime(df["Order Date"],format="%d-%m-%Y")

In [107]:
df["Order_month"]=df["Order Date"].dt.month

In [108]:
df["Order_year"]=df["Order Date"].dt.year

In [110]:
df["Discounted_price"]=df["List Price"]-df["List Price"]*df["Discount Percent"]/100

In [112]:
df["Total_Sales"]=df["Discounted_price"]*df["Quantity"]

In [118]:
df["Total_profit"]=df["Total_Sales"]-(df["cost price"]*df["Quantity"])

In [117]:
temp

0        29.6
1       324.3
2        -1.0
3       804.0
4        -2.0
        ...
9989     -3.6
9990     32.8
9991     69.6
9992     -3.6
9993     45.6
Length: 9994, dtype: float64

In [119]:
df.head(2)

,Order Id,Order Date,Ship Mode,Segment,Country,City,State,Postal Code,Region,Category,...,Product Id,cost price,List Price,Quantity,Discount Percent,Order_month,Order_year,Discounted_price,Total_Sales,Total_profit
0,1,2023-03-01,Second Class,Consumer,United States,Henderson,Kentucky,42420,South,Furniture,...,FUR-BO-10001798,240,260,2,2,3,2023,254.8,509.6,29.6
1,2,2023-08-15,Second Class,Consumer,United States,Henderson,Kentucky,42420,South,Furniture,...,FUR-CH-10000454,600,730,3,3,8,2023,708.1,2124.3,324.3

In [133]:
 # . Unique Values: How many unique products are sold?
df["Product Id"].nunique()

1862

In [152]:
# Sort the dataset by 'Order Date' in descending order
df.sort_values(by="Order Date", ascending=False)

,Order Id,Order Date,Ship Mode,Segment,Country,City,State,Postal Code,Region,Category,...,Product Id,cost price,List Price,Quantity,Discount Percent,Order_month,Order_year,Discounted_price,Total_Sales,Total_profit
2957,2958,2023-12-31,Standard Class,Consumer,United States,Springfield,Ohio,45503,East,Office Supplies,...,OFF-BI-10003910,0,0,1,3,12,2023,0.0,0.0,0.0
7683,7684,2023-12-31,First Class,Home Office,United States,Midland,Michigan,48640,Central,Office Supplies,...,OFF-BI-10003527,3160,3810,3,3,12,2023,3695.7,11087.1,1607.1
5471,5472,2023-12-31,Standard Class,Consumer,United States,Parker,Colorado,80134,West,Furniture,...,FUR-FU-10000320,10,10,5,5,12,2023,9.5,47.5,-2.5
8377,8378,2023-12-31,Standard Class,Corporate,United States,Houston,Texas,77095,Central,Office Supplies,...,OFF-ST-10002344,50,60,1,4,12,2023,57.6,57.6,7.6
910,911,2023-12-31,Standard Class,Home Office,United States,Jackson,Michigan,49201,Central,Technology,...,TEC-AC-10004666,1830,1930,7,4,12,2023,1852.8,12969.6,159.6
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
6195,6196,2022-01-01,Standard Class,Consumer,United States,Philadelphia,Pennsylvania,19143,East,Technology,...,TEC-PH-10004165,300,330,2,3,1,2022,320.1,640.2,40.2
7971,7972,2022-01-01,Standard Class,Corporate,United States,Philadelphia,Pennsylvania,19134,East,Technology,...,TEC-AC-10004227,30,30,3,3,1,2022,29.1,87.3,-2.7
3790,3791,2022-01-01,Standard Class,Home Office,United States,Los Angeles,California,90004,West,Office Supplies,...,OFF-BI-10001670,150,180,6,4,1,2022,172.8,1036.8,136.8
4278,4279,2022-01-01,Standard Class,Corporate,United States,Lakewood,New Jersey,8701,East,Furniture,...,FUR-FU-10000550,10,10,2,3,1,2022,9.7,19.4,-0.6
567,568,2022-01-01,Standard Class,Corporate,United States,Seattle,Washington,98105,West,Office Supplies,...,OFF-BI-10001107,70,80,7,4,1,2022,76.8,537.6,47.6

In [148]:
#  Filtering Data: Write a Python code to filter records only from the 'Furniture' category.
df.query("Category=='Furniture'")

,Order Id,Order Date,Ship Mode,Segment,Country,City,State,Postal Code,Region,Category,...,Product Id,cost price,List Price,Quantity,Discount Percent,Order_month,Order_year,Discounted_price,Total_Sales,Total_profit
0,1,2023-03-01,Second Class,Consumer,United States,Henderson,Kentucky,42420,South,Furniture,...,FUR-BO-10001798,240,260,2,2,3,2023,254.8,509.6,29.6
1,2,2023-08-15,Second Class,Consumer,United States,Henderson,Kentucky,42420,South,Furniture,...,FUR-CH-10000454,600,730,3,3,8,2023,708.1,2124.3,324.3
3,4,2022-06-18,Standard Class,Consumer,United States,Fort Lauderdale,Florida,33311,South,Furniture,...,FUR-TA-10000577,780,960,5,2,6,2022,940.8,4704.0,804.0
5,6,2022-03-13,Standard Class,Consumer,United States,Los Angeles,California,90032,West,Furniture,...,FUR-FU-10001487,50,50,7,3,3,2022,48.5,339.5,-10.5
10,11,2023-03-31,Standard Class,Consumer,United States,Los Angeles,California,90032,West,Furniture,...,FUR-TA-10001539,1470,1710,9,3,3,2023,1658.7,14928.3,1698.3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9962,9963,2022-09-02,First Class,Home Office,United States,Houston,Texas,77041,Central,Furniture,...,FUR-BO-10004218,320,380,4,3,9,2022,368.6,1474.4,194.4
9964,9965,2023-07-08,Second Class,Corporate,United States,Newark,Delaware,19711,East,Furniture,...,FUR-FU-10002671,10,10,1,3,7,2023,9.7,9.7,-0.3
9980,9981,2023-06-26,Second Class,Consumer,United States,Lafayette,Louisiana,70506,South,Furniture,...,FUR-TA-10001039,80,90,1,2,6,2023,88.2,88.2,8.2
9989,9990,2023-02-18,Second Class,Consumer,United States,Miami,Florida,33180,South,Furniture,...,FUR-FU-10001889,30,30,3,4,2,2023,28.8,86.4,-3.6
9990,9991,2023-03-17,Standard Class,Consumer,United States,Costa Mesa,California,92627,West,Furniture,...,FUR-FU-10000747,70,90,2,4,3,2023,86.4,172.8,32.8

In [153]:
# Simple Aggregation: What is the total quantity sold for the 'Office Supplies' category?
df.groupby("Category").sum("Quantity")["Quantity"]

Category
Furniture           8028
Office Supplies    22906
Technology          6939
Name: Quantity, dtype: int64

In [154]:
# Group By Aggregations: What is the average unit selling price per category?
df.groupby("Category").mean("Total_Sales")["Total_Sales"]

Category
Furniture          1754.239698
Office Supplies     568.150531
Technology         2130.433514
Name: Total_Sales, dtype: float64

In [170]:
df.groupby("Product Id").sum("Total_Sales").sort_values(by=["Total_profit"],ascending=False).reset_index()[["Product Id","Total_profit"]].head(10)

        Product Id  Total_profit
0  TEC-CO-10004722       24816.0
1  TEC-MA-10002412       21746.4
2  OFF-BI-10000545       17867.7
3  TEC-CO-10001449       15948.0
4  FUR-CH-10002024       13930.7
5  OFF-BI-10003527       12792.9
6  TEC-PH-10001459       11481.9
7  TEC-MA-10000822       10102.3
8  FUR-TA-10000198       10015.1
9  TEC-MA-10001047        9989.0

In [175]:
# All the product with Technology category and the shipment mode is Second Class
df[(df["Category"]=='Technology') & (df["Ship Mode"]=="Second Class")].sort_values(by=["Order Date"],ascending=True)

,Order Id,Order Date,Ship Mode,Segment,Country,City,State,Postal Code,Region,Category,...,Product Id,cost price,List Price,Quantity,Discount Percent,Order_month,Order_year,Discounted_price,Total_Sales,Total_profit
5420,5421,2022-01-01,Second Class,Consumer,United States,Philadelphia,Pennsylvania,19134,East,Technology,...,TEC-PH-10002789,260,280,3,4,1,2022,268.8,806.4,26.4
1087,1088,2022-01-04,Second Class,Corporate,United States,Oakland,California,94601,West,Technology,...,TEC-PH-10004896,60,70,3,2,1,2022,68.6,205.8,25.8
3271,3272,2022-01-05,Second Class,Corporate,United States,Visalia,California,93277,West,Technology,...,TEC-AC-10003709,10,10,8,2,1,2022,9.8,78.4,-1.6
3526,3527,2022-01-06,Second Class,Home Office,United States,Jackson,Mississippi,39212,South,Technology,...,TEC-PH-10000148,40,40,3,4,1,2022,38.4,115.2,-4.8
9949,9950,2022-01-07,Second Class,Corporate,United States,Indianapolis,Indiana,46203,Central,Technology,...,TEC-AC-10004568,70,80,3,3,1,2022,77.6,232.8,22.8
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2451,2452,2023-12-23,Second Class,Consumer,United States,New York City,New York,10011,East,Technology,...,TEC-PH-10000149,100,120,6,3,12,2023,116.4,698.4,98.4
2104,2105,2023-12-26,Second Class,Corporate,United States,New York City,New York,10009,East,Technology,...,TEC-AC-10001266,30,30,2,3,12,2023,29.1,58.2,-1.8
1666,1667,2023-12-28,Second Class,Consumer,United States,Dallas,Texas,75217,Central,Technology,...,TEC-AC-10003023,90,90,2,3,12,2023,87.3,174.6,-5.4
8248,8249,2023-12-30,Second Class,Home Office,United States,Philadelphia,Pennsylvania,19134,East,Technology,...,TEC-PH-10001795,610,740,2,5,12,2023,703.0,1406.0,186.0
5341,5342,2023-12-31,Second Class,Consumer,United States,Oceanside,New York,11572,East,Technology,...,TEC-AC-10002637,770,900,5,4,12,2023,864.0,4320.0,470.0

In [177]:
# Average sale 
df["Total_Sales"].mean()

1108.5979787872725

In [194]:
# City with Highest quantity of product ordered
df.groupby("City").sum("Quantity").reset_index().sort_values(by=["Quantity"],ascending=False)[["City","Quantity"]].head(10)

              City  Quantity
329  New York City      3417
266    Los Angeles      2879
374   Philadelphia      1981
438  San Francisco      1935
452        Seattle      1590
207        Houston      1466
80         Chicago      1132
94        Columbus       836
437      San Diego       670
464    Springfield       649

In [195]:
# Region with Highest quantity of product ordered
df.groupby("Region").sum("Quantity").reset_index().sort_values(by=["Quantity"],ascending=False)[["Region","Quantity"]].head(10)

    Region  Quantity
3     West     12266
1     East     10618
0  Central      8780
2    South      6209

In [231]:
# total sale in all year first quadrent
df["Quarter"]=df["Order Date"].dt.quarter

In [232]:
df.head(2)

,Order Id,Order Date,Ship Mode,Segment,Country,City,State,Postal Code,Region,Category,...,cost price,List Price,Quantity,Discount Percent,Order_month,Order_year,Discounted_price,Total_Sales,Total_profit,Quarter
0,1,2023-03-01,Second Class,Consumer,United States,Henderson,Kentucky,42420,South,Furniture,...,240,260,2,2,3,2023,254.8,509.6,29.6,1
1,2,2023-08-15,Second Class,Consumer,United States,Henderson,Kentucky,42420,South,Furniture,...,600,730,3,3,8,2023,708.1,2124.3,324.3,3

In [239]:
Quarter_sales=df.groupby(["Order_year","Quarter"]).sum(["Total_Sales"])["Total_Sales"].reset_index()

In [241]:
Quarter_sales

   Order_year  Quarter  Total_Sales
0        2022        1    1275547.6
1        2022        2    1355326.7
2        2022        3    1343727.8
3        2022        4    1500939.2
4        2023        1    1559456.2
5        2023        2    1282878.4
6        2023        3    1308164.5
7        2023        4    1453287.8

In [242]:
Quarter_sales[Quarter_sales["Quarter"]==1]

   Order_year  Quarter  Total_Sales
0        2022        1    1275547.6
4        2023        1    1559456.2

In [243]:
# total qty sales in all year first quadrent
Quarter_qty_sales=df.groupby(["Order_year","Quarter"]).sum(["Quantity"])["Quantity"].reset_index()

In [244]:
Quarter_qty_sales[Quarter_qty_sales["Quarter"]==1]

   Order_year  Quarter  Quantity
0        2022        1      4608
4        2023        1      4768

In [248]:
# Highest profit generated product
df.groupby("Product Id").sum("Total_profit")["Total_profit"].reset_index().sort_values(by=["Total_profit"],ascending=False).head(10)

           Product Id  Total_profit
1614  TEC-CO-10004722       24816.0
1642  TEC-MA-10002412       21746.4
657   OFF-BI-10000545       17867.7
1604  TEC-CO-10001449       15948.0
80    FUR-CH-10002024       13930.7
776   OFF-BI-10003527       12792.9
1724  TEC-PH-10001459       11481.9
1624  TEC-MA-10000822       10102.3
318   FUR-TA-10000198       10015.1
1630  TEC-MA-10001047        9989.0

In [257]:
# Top 3 selling product in each region acc to qty
Highest_sales=df.groupby(["Region","Product Id"]).sum("Quantity")["Quantity"].reset_index().sort_values(by=["Region","Quantity"],ascending=[True,False])

In [258]:
Highest_sales

       Region       Product Id  Quantity
461   Central  OFF-BI-10000301        34
474   Central  OFF-BI-10000756        33
470   Central  OFF-BI-10000546        29
491   Central  OFF-BI-10001249        29
61    Central  FUR-CH-10002304        27
...       ...              ...       ...
5219     West  TEC-PH-10002185         1
5227     West  TEC-PH-10002447         1
5229     West  TEC-PH-10002483         1
5256     West  TEC-PH-10003357         1
5276     West  TEC-PH-10004120         1

[5298 rows x 3 columns]

In [259]:
Highest_sales["Region"].unique()

array(['Central', 'East', 'South', 'West'], dtype=object)

In [261]:
Highest_sales[Highest_sales["Region"]=="Central"].head(3)

      Region       Product Id  Quantity
461  Central  OFF-BI-10000301        34
474  Central  OFF-BI-10000756        33
470  Central  OFF-BI-10000546        29

In [262]:
Highest_sales[Highest_sales["Region"]=="East"].head(3)

     Region       Product Id  Quantity
2190   East  OFF-PA-10001970        33
1914   East  OFF-BI-10003656        32
1549   East  FUR-FU-10004848        31

In [263]:
Highest_sales[Highest_sales["Region"]=="South"].head(3)

     Region       Product Id  Quantity
3560  South  OFF-ST-10003716        26
2757  South  FUR-CH-10000513        24
3231  South  OFF-BI-10004728        24

In [264]:
Highest_sales[Highest_sales["Region"]=="West"].head(3)

     Region       Product Id  Quantity
5088   West  TEC-AC-10003832        45
4321   West  OFF-BI-10000174        32
4346   West  OFF-BI-10001036        31

In [267]:
# Total sales in each Region
df.groupby("Region").sum("Total_Sales")["Total_Sales"].reset_index()

    Region  Total_Sales
0  Central    2387881.2
1     East    3257983.8
2    South    1966053.6
3     West    3467409.6

In [273]:
# Month over month sales comparision for the year 2022 and 2023
mom_sales=df.groupby(["Order_year","Order_month"]).sum("Total_Sales")["Total_Sales"].reset_index()

In [286]:
mom_sales

    Order_year  Order_month  Total_Sales
0         2022            1     437431.3
1         2022            2     444011.1
2         2022            3     394105.2
3         2022            4     476400.9
4         2022            5     413625.5
5         2022            6     465300.3
6         2022            7     375278.4
7         2022            8     534562.4
8         2022            9     433887.0
9         2022           10     601707.8
10        2022           11     451809.6
11        2022           12     447421.8
12        2023            1     434765.5
13        2023            2     731638.8
14        2023            3     393051.9
15        2023            4     543231.5
16        2023            5     410707.9
17        2023            6     328939.0
18        2023            7     422533.7
19        2023            8     465010.3
20        2023            9     420620.5
21        2023           10     626498.3
22        2023           11     334940.6
23        2023           12     491848.9

In [277]:
Pivot=mom_sales.pivot_table(index="Order_month",columns="Order_year",values="Total_Sales",aggfunc="sum").reset_index()

In [287]:
Pivot["Sales_diff"]=Pivot[2022]-Pivot[2023]

In [290]:
Pivot

Order_year  Order_month      2022      2023  Sales_diff
0                     1  437431.3  434765.5      2665.8
1                     2  444011.1  731638.8   -287627.7
2                     3  394105.2  393051.9      1053.3
3                     4  476400.9  543231.5    -66830.6
4                     5  413625.5  410707.9      2917.6
5                     6  465300.3  328939.0    136361.3
6                     7  375278.4  422533.7    -47255.3
7                     8  534562.4  465010.3     69552.1
8                     9  433887.0  420620.5     13266.5
9                    10  601707.8  626498.3    -24790.5
10                   11  451809.6  334940.6    116869.0
11                   12  447421.8  491848.9    -44427.1

In [292]:
import mysql.connector as sql

In [299]:
mydb=sql.connect(
                host="localhost",
                user="root",
                password="sunil",
                database="Analyse"
                )
curser=mydb.cursor()

In [301]:
#!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\dell\anaconda3\lib\site-packages (1.4.39)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\dell\anaconda3\lib\site-packages (from sqlalchemy) (2.0.1)

In [304]:
from sqlalchemy import create_engine
engine = create_engine('mysql+mysqlconnector://root:sunil@localhost/Analyse')

In [305]:
df.to_sql('orders_data', con=engine, if_exists='replace', index=False)

9994

In [306]:
data=pd.read_sql_query("select * from orders_data",mydb)

C:\Users\DELL\AppData\Local\Temp\ipykernel_13764\3081610704.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  data=pd.read_sql_query("select * from orders_data",mydb)

In [308]:
data.head(2)

,Order Id,Order Date,Ship Mode,Segment,Country,City,State,Postal Code,Region,Category,...,cost price,List Price,Quantity,Discount Percent,Order_month,Order_year,Discounted_price,Total_Sales,Total_profit,Quarter
0,1,2023-03-01,Second Class,Consumer,United States,Henderson,Kentucky,42420,South,Furniture,...,240,260,2,2,3,2023,254.8,509.6,29.6,1
1,2,2023-08-15,Second Class,Consumer,United States,Henderson,Kentucky,42420,South,Furniture,...,600,730,3,3,8,2023,708.1,2124.3,324.3,3